# IFC_SetDSFieldVis

## Description
Sets Data Sheet field visibility.

```pascal
FUNCTION IFC_SetDSFieldVis(
				objectName    : STRING;
				dataSheetName : STRING;
				fieldLabel    : STRING;
				isVisible     : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_SetDSFieldVis(objectName, dataSheetName, fieldLabel, isVisible):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING||
|dataSheetName|STRING||
|fieldLabel|STRING||
|isVisible|BOOLEAN||

## Version
Availability: from Vectorworks 2023.4
## Category
* IFC